app/controllers/competicao_controller.rb

  def index
    @competicao = Competicao.order :nome
---
SELECT `competicaos`.* FROM `competicaos`  ORDER BY `competicaos`.`nome` ASC

  def show
    @competicao = Competicao.find(params[:id])
---
SELECT  `competicaos`.* FROM `competicaos` WHERE `competicaos`.`id` = 4 LIMIT 1