app/controllers/competicaos_controller.rb

  def index
    @competicao = Competicao.order :nome
---
SELECT `competicaos`.* FROM `competicaos`  ORDER BY `competicaos`.`nome` ASC

  def show
    @competicao = Competicao.find(params[:id])
---
SELECT  `competicaos`.* FROM `competicaos` WHERE `competicaos`.`id` = 4 LIMIT 1

  def create
    @competicao = Competicao.new competicao_params
    @competicao.save
---
INSERT INTO `competicaos` (`nome`) VALUES ('Teste')